In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series\n" , series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# Series from Dictianary
data = {'a':1,'b':2,'c':3}
seris_dict = pd.Series(data)
print("Series_Dict\n",seris_dict)

Series_Dict
 a    1
b    2
c    3
dtype: int64

In [4]:
# Create A DataFrame form Dictanary of list

data ={
    'Name':['Hetal','Shreya','Anushka'],
    'Age':[20 , 21, 22],
    'City':['Dhule','Satara','Nagar']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar
<class 'pandas.core.frame.DataFrame'>

In [5]:
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [6]:
df.loc[0]

Name    Hetal
Age        20
City    Dhule
Name: 0, dtype: object

In [7]:
df.iloc[0][0]

C:\Users\hetal\AppData\Local\Temp\ipykernel_23944\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Hetal'

In [8]:
# Accessing the Specified Element
df.at[1 ,'Name']

'Shreya'

In [9]:
df.iat[2,2]

'Nagar'

In [10]:
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [11]:
# Data Manipulation in Dataframe
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [12]:
# Adding New Coloumn of Salary
df['Salary'] = [50000, 60000, 700000]
df

      Name  Age    City  Salary
0    Hetal   20   Dhule   50000
1   Shreya   21  Satara   60000
2  Anushka   22   Nagar  700000

In [13]:
# Create A DataFrame form Dictanary of list
import pandas as pd
data ={
    'Name':['Hetal','Shreya','Anushka'],
    'Age':[20 , 21, 22],
    'City':['Dhule','Satara','Nagar'],
    'Salary' : [50000,60000,70000]
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age    City  Salary
0    Hetal   20   Dhule   50000
1   Shreya   21  Satara   60000
2  Anushka   22   Nagar   70000
<class 'pandas.core.frame.DataFrame'>

In [14]:
df.drop('Salary',axis=1 , inplace=True)
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [15]:
print(list(df.columns))

['Name', 'Age', 'City']

In [16]:
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [17]:
df

      Name  Age    City
0    Hetal   20   Dhule
1   Shreya   21  Satara
2  Anushka   22   Nagar

In [18]:
df['Age']=df['Age']-1
df

      Name  Age    City
0    Hetal   19   Dhule
1   Shreya   20  Satara
2  Anushka   21   Nagar